# GetDocument Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
UpdaterData..::..GetDocument Method
UpdaterData Class See Also
---
Returns document associated with this UpdaterData
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public Document GetDocument()
```

Visual Basic
---
```text
Public Function GetDocument As Document
```

Visual C++
---
```text
public:
Document^ GetDocument()
```

# See Also
UpdaterData Class
Autodesk.Revit.DB Namespace